<?php

/**
 * type=1 {Кириллица-Латиницу} | type=2 {Латиница-Кирилицу}
 * @param string $text
 * @param int $type
 * @return array|string|string[]
 */
function cyr_to_lat(string $text, int $type = 1) {
    $cyr = [
        'а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п', 'р','с','т','у','ф','х','ц','ч','ш','щ','ы','э','ю','я',' ',
        'А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П', 'Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ы','Э','Ю','Я'
    ];
    $lat = [
        'a','b','v','g','d','e','io','zh','z','i','y','k','l','m','n','o','p', 'r','s','t','u','f','h','ts','ch','sh','sht','y','e','yu','ya','-',
        'A','B','V','G','D','E','Io','Zh','Z','I','Y','K','L','M','N','O','P', 'R','S','T','U','F','H','Ts','Ch','Sh','Sht','Y','E','Yu','Ya'
    ];
    return $type === 1
        ? str_replace($cyr, $lat, $text)
        : str_replace($lat, $cyr, $text);
}
